# Práctica 1: Análisis exploratorio de datos, preprocesamiento y validación de modelos de clasificación

## Minería de Datos

### Curso académico 2021-2022

#### Profesorado:

* Juan Carlos Alfaro Jiménez
* José Antonio Gámez Martín

---
#### Alumnos:
* Raúl Milla
* Juan Ibañez
---

**Notas**:

* Adaptado de las prácticas de Jacinto Arias Martínez y Enrique González Rodrigo.

---

## 1.Preliminares

Para empezar tendremos que crear la semilla e implementar las funciones que usaremos más adelante

In [10]:
from sklearn.metrics import classification_report, plot_confusion_matrix
from IPython.display import display
from sklearn.model_selection import train_test_split
import pandas as pd
def fit_evaluate(estimator, X_train, X_test, y_train, y_test):
    """Fit the estimator to the training dataset and evaluate in the testing dataset."""
    # Fit the model according to the given training dataset
    estimator = estimator.fit(X_train, y_train)

    # Predict the class labels for the testing dataset
    predictions = estimator.predict(X_test)

    # Build a text report (in a dictionary) with the main classification metrics
    report = classification_report(y_test, predictions, output_dict=True)

    # Convert the dictionary to tabular data
    report = pd.DataFrame(report).T

    # Display the text report
    display(report)

    # Plot the confusion matrix for the testing dataset
    plot_confusion_matrix(estimator, X_test, y_test);

    return estimator, predictions
random_state = 27912

## 2.Acceso y almacenamiento de datos

A continuacion importaremos los datos de titanic en nuestra libreta,para ello importaremos los datos del `train` ya que era un torneo de kagle.Utilizaremos como columna id la columna `PassengerId`.

In [3]:
data = pd.read_csv("../input/titanic/train.csv",index_col="PassengerId")

La variable clase sera el atributo `Survived` y le ponemos que sea tipo `category`

In [4]:
target = "Survived"

In [5]:
data[target] = data[target].astype("category")

Hacemos una comprobacion del conjunto

In [6]:
data.sample(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
491,0,3,"Hagland, Mr. Konrad Mathias Reiersen",male,NaN,1,0,65304,19.9667,NaN,S
60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S

A continuacion separamos la variable clase de las demas

In [7]:
X=data.drop(target,axis=1)
y= data[target]

Comprobamos que efectivamente se ha hecho la separacion de manera correcta

In [8]:
X.sample(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
410,3,"Lefebre, Miss. Ida",female,NaN,3,1,4133,25.4667,NaN,S
261,3,"Smith, Mr. Thomas",male,NaN,0,0,384461,7.7500,NaN,Q
308,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
182,2,"Pernot, Mr. Rene",male,NaN,0,0,SC/PARIS 2131,15.0500,NaN,C
770,3,"Gronnestad, Mr. Daniel Danielsen",male,32.0,0,0,8471,8.3625,NaN,S

In [9]:
y.sample(5)

PassengerId
339    1
600    1
636    1
573    1
878    0
Name: Survived, dtype: category
Categories (2, int64): [0, 1]

A continuacion creamos dos subconjuntos siendo uno de un 70% del subconjunto total y otro un 30 % ya que el primero es el train y el segundo es el

In [11]:
X_train, X_test, y_train, y_test = train_test_split(X, y, stratify=y, random_state=random_state, train_size=0.7)

In [12]:
X_train.sample(5, random_state=random_state)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
687,3,"Panula, Mr. Jaako Arnold",male,14.0,4,1,3101295,39.6875,NaN,S
786,3,"Harmer, Mr. Abraham (David Lishin)",male,25.0,0,0,374887,7.2500,NaN,S
685,2,"Brown, Mr. Thomas William Solomon",male,60.0,1,1,29750,39.0000,NaN,S
885,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
609,2,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.0,1,2,SC/Paris 2123,41.5792,NaN,C

In [13]:
X_test.sample(5, random_state=random_state)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
352,1,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S
429,3,"Flynn, Mr. James",male,NaN,0,0,364851,7.7500,NaN,Q
264,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0000,B94,S
644,3,"Foo, Mr. Choong",male,NaN,0,0,1601,56.4958,NaN,S
202,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.5500,NaN,S

In [14]:
y_train.sample(5, random_state=random_state)

PassengerId
687    0
786    0
685    0
885    0
609    1
Name: Survived, dtype: category
Categories (2, int64): [0, 1]

In [15]:
y_test.sample(5, random_state=random_state)

PassengerId
352    0
429    0
264    0
644    1
202    0
Name: Survived, dtype: category
Categories (2, int64): [0, 1]

In [16]:
data_train = X_train.join(y_train)

In [17]:
data_test = X_test.join(y_test)

In [18]:
data_train.sample(5, random_state=random_state)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
687,3,"Panula, Mr. Jaako Arnold",male,14.0,4,1,3101295,39.6875,NaN,S,0
786,3,"Harmer, Mr. Abraham (David Lishin)",male,25.0,0,0,374887,7.2500,NaN,S,0
685,2,"Brown, Mr. Thomas William Solomon",male,60.0,1,1,29750,39.0000,NaN,S,0
885,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,0
609,2,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.0,1,2,SC/Paris 2123,41.5792,NaN,C,1

In [19]:
data_test.sample(5, random_state=random_state)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
352,1,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S,0
429,3,"Flynn, Mr. James",male,NaN,0,0,364851,7.7500,NaN,Q,0
264,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0000,B94,S,0
644,3,"Foo, Mr. Choong",male,NaN,0,0,1601,56.4958,NaN,S,1
202,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.5500,NaN,S,0